<?php
/**
 * Created by PhpStorm.
 * User: 李明泽
 * Date: 2018/3/23
 * Time: 14:53
 */
/*
 * 按位与运算符（&）
参加运算的两个数据，按二进制位进行“与”运算。
运算规则：0&0=0;  0&1=0;   1&0=0;    1&1=1;
即：两位同时为“1”，结果才为“1”，否则为0
例如：3&5  即 0000 0011& 0000 0101 = 00000001  因此，3&5的值得1。
*/

/*
 * 左移：末尾补0
 * 00001010<<2=00101000
 * 10001010<<3=01010000
 *
 * 右移：
 * 正数：高位补0
 * 00001010>>2=00000010
 * 负数：高位补1（最高位永远是1）
 * 10001010>>3=11110001
 * */
function numof1($num)
{
    $count = 0;
    if ($num >= 0) {
        while ($num) {

            if ($num & 1 == 1) {
                $count++;
            }
            $num = $num >> 1;
        }
    } else {
        //左移比较，原数与左移的1比较，与运算过后如果不是0，则原数当前位为1
        $i = 1;
        while ($i) {

            if ($num & $i) {
                $count++;
            }
            $i = $i << 1;
        }
    }

    echo $count;
}

numof1(0);